Revit 2027 API
DataExchangeMessageVerbosity Enumeration
 Predefined verbosity levels for DataExchangeLog
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum DataExchangeMessageVerbosity
Public Enumeration DataExchangeMessageVerbosity
public enum class DataExchangeMessageVerbosity
type DataExchangeMessageVerbosity
Members
Member name | Value | Description
Default | 1 |  Default verbosity. Warnings, errors, fatal errors are reported.
Minimal | 0 |  Minimal verbosity. Only fatal errors are reported.
Verbose | 2 |  All events are reported.
See Also
Reference
Autodesk.Revit.DB Namespace